testcase2/inter/system/controlDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include the boundary conditions
libs
(
    "lib_BAW_public_BCs_v2212_20250109.so"
);


startFrom       latestTime;
// startFrom       startTime;
startTime       0.;
stopAt          endTime;
endTime         100.;

deltaT          0.01;  // Initial time step length
adjustTimeStep  on;    // Adapt timestep based on Courant criterion                

maxCo       5.;   // Maximum Courant number. For RANS maxCo>1 is o.k., if these stable and CFL>1 areas are checked later.
maxAlphaCo  3.;   // Maximum Courant number near the water surface. For maxAlphaCo>1 set fvSolution:alpha.water:nAlphaSubCycles to maxAlphaCo+1!
maxDeltaT   0.05; // Maximum allowed time step length

// writeControl    timeStep;   // Adapt timestep according to write intervals
writeControl    adjustableRunTime;   // Adapt timestep according to write intervals
writeInterval   10;                  // Write full results every 1 s  
purgeWrite      10;                  // Keep only the latest n results! (0 = all results)

writeFormat     binary;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable on;


functions
{                                   
    //- Calculate and write CFL-numbers each time results are written    
    #include "functionObjects/CFL"

    //- Calculate and log extreme field values 
    #include "functionObjects/fieldMinMax"

    //- Limit extreme field values for the sake of stability 
    // #include "functionObjects/limitFields"

    //- Calculate averages for certain field variables, starting at a certain time
    #include "functionObjects/fieldAverage"

    //- Calculates yPlus values on surfaces
    #include "functionObjects/yPlus"

    //- Writes out values of fields from cells nearest to specified locations (into postProcessing directory).
    #include "functionObjects/probes"
    #include "functionObjects/probeLine"
    
    //- Calculates the flow rate through a specified patch by summing the flux on patch faces.
    #include "functionObjects/patchWaterFlowRate"

}

