testcase2/inter/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    xmin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       972832;
    }
    xmax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       973090;
    }
    zmax
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3152;
        startFace       973348;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5932;
        startFace       976500;
    }
    mywalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          23809;
        startFace       982432;
    }
    frontplate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1338;
        startFace       1006241;
    }
    crown
    {
        type            wall;
        inGroups        1(wall);
        nFaces          798;
        startFace       1007579;
    }
    backplate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1920;
        startFace       1008377;
    }
    ventilation
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       1010297;
    }
)

// ************************************************************************* //
