testcase2/inter/0/alpha.water
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.;


boundaryField
{
    xmin
    {
        type flowRateWaterAlpha;      // Behaves like zeroGradient with additions to avoid bubbles or rain.
 
        // ADVANCED ENTRIES:
        // pressureThreshold  10000.; // For all boundary cells with pressure p above pressureThreshold alpha.water=1
        //                                         is prescribed. This avoids bubbles in the region with p>pressureThreshold.
        // sharpen              0.01; // Low values increase bubble risk, high values "bend" the water surface
        alphaLowerThreshold  0.001;   // Allow flow for cells with alpha.water < 0.001
        alphaUpperThreshold  0.999;   // Allow flow for cells with alpha.water > 0.999

        value           uniform 0.;
    }
    xmax
    {
        type            waterLevel_alpha_prgh;  // Behaves like zeroGradient at an outlet and like a Dirichlet-BC at an inlet.
        mode            singleValue;            // singleValue, ratingCurveTable, timeSeries or waterStorageTable 
        data            0.25;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h or between V and h  
        
        // OPTIONAL ENTRIES:
        // flowRateMultiplier    1.0;           // For "slice" models: Multiply Q with flowRateMultiplier before evaluating h 
        
        value uniform   1.;                     // Initial value for alpha
    }
    
    zmax
    {
        type            waterLevel_alpha_prgh;  // Behaves like zeroGradient at an outlet and like a Dirichlet-BC at an inlet.
        mode            singleValue;            // singleValue, ratingCurveTable, timeSeries or waterStorageTable 
        data            0.25;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h or between V and h  
        
        // OPTIONAL ENTRIES:
        // flowRateMultiplier    1.0;           // For "slice" models: Multiply Q with flowRateMultiplier before evaluating h 
        
        value uniform   1.;                     // Initial value for alpha
    }
    
    bottom
    {
        type            zeroGradient;
    }
    mywalls
    {
        type            zeroGradient;
    }
    frontplate
    {
        type            zeroGradient;
    }
    crown
    {
        type            zeroGradient;
    }
    backplate
    {
        type            zeroGradient;
    }
    ventilation
    {
        type            waterLevel_alpha_prgh;  // Behaves like zeroGradient at an outlet and like a Dirichlet-BC at an inlet.
        mode            singleValue;            // singleValue, ratingCurveTable, timeSeries or waterStorageTable 
        data            0.25;                   // water level [m]. Alternative: Supply a table for functions

        // data     table  (
        //                (0   2.41)
        //                (100 2.41)
        //          );                          // table for dependency between Q and h  or between t and h or between V and h  
        
        // OPTIONAL ENTRIES:
        // flowRateMultiplier    1.0;           // For "slice" models: Multiply Q with flowRateMultiplier before evaluating h 
        
        value uniform   1.;                     // Initial value for alpha
    }
    
}
