testcase2/inter/0/blueprints/waterlevel/k
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    
