testcase2/inter/0/omega
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.25;


boundaryField
{
    xmin
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    xmax
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    
    zmax
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    
    bottom
    {
        type            zeroGradient;
    }
    
    mywalls
    {
        type            zeroGradient;
    }
    
    frontplate
    {
        type            zeroGradient;
    }
    
    crown
    {
        type            zeroGradient;
    }
    
    backplate
    {
        type            zeroGradient;
    }
    
    ventilation
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    
}
